2021-03-05-ffmpeg_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-13 Sat 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ffmpeg notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shyam" />
</head>
<body>
<div id="content">
<h1 class="title">ffmpeg notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org603c025">1. trim</a></li>
<li><a href="#org203eead">2. join</a></li>
<li><a href="#orgf246567">3. convert containers</a></li>
<li><a href="#org0834fa6">4. add text</a></li>
</ul>
</div>
</div>
<p>
NASA's Perseverance rover uses ffmpeg.
</p>

<p>
<a href="http:">Mars Rover Perseverence FFmpeg</a>
</p>

<p>
<a href="https://ostechnix.com/20-ffmpeg-commands-beginners/">20+ FFmpeg Commands For Beginners - OSTechNix</a>
</p>

<p>
<a href="https://ottverse.com/crossfade-between-videos-ffmpeg-xfade-filter/">CrossFade, Dissolve, and other Effects using FFmpeg's xfade Filter -
OTTVerse</a>
</p>

<div id="outline-container-org603c025" class="outline-2">
<h2 id="org603c025"><span class="section-number-2">1</span> trim</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -i input.mp4 -ss <span style="color: #da8548; font-weight: bold;">01:19:27</span> -to <span style="color: #da8548; font-weight: bold;">02:18:51</span> -c:v copy -c:a copy output.mp4
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">This will cut out the section from about 1h19min (after the -ss</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">command) to 2h18min (after the -to command). The copy parts of the</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">command are meant to copy both the original audio and video content</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">without recompressing. This means that the above command only takes a</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">few seconds to run.</span>

ffmpeg -i input.mp4 -ss <span style="color: #da8548; font-weight: bold;">00:01:10</span> -t <span style="color: #da8548; font-weight: bold;">00:01:05</span> -c:v copy -c:a copy output.mp4

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">This will extract 1min5sec (using the -t flag) starting from</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">1min10sec (the -ss flag) in the file. Happy trimming!</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org203eead" class="outline-2">
<h2 id="org203eead"><span class="section-number-2">2</span> join</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">cat fileList.txt
file <span style="color: #98be65;">'/home/file1.mp4'</span>
file <span style="color: #98be65;">'/home/file1.mp4'</span>

ffmpeg -f concat -safe <span style="color: #da8548; font-weight: bold;">0</span> -i fileList.txt -c copy mergedVideo.mp4
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf246567" class="outline-2">
<h2 id="orgf246567"><span class="section-number-2">3</span> convert containers</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -i infile.mov -acodec copy -vcodec copy outfile.mp4
</pre>
</div>
</div>
</div>

<div id="outline-container-org0834fa6" class="outline-2">
<h2 id="org0834fa6"><span class="section-number-2">4</span> add text</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">ffmpeg -i inputClip.mp4 -vf <span style="color: #98be65;">"drawtext=text='&#169;Krishna':x=(1100-text_w):y=(600-text_h):fontsize=32:fontcolor=black:box=1:boxcolor=white@0.5:boxborderw=5"</span> -c:a copy output.mp4
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">box : this is either 1 (enabled) or 0 (disabled)</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">boxcolor: white@0.5 implies a white colored box with a 50% opacity.</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">boxborderw is the width of the box&#8217;s border and the border color is taken from boxcolor.</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Display Movie Credits using FFmpeg&#8217;s drawtext filter</span>
ffmpeg -i inputClip.mp4 -vf <span style="color: #98be65;">"drawtext=textfile=credits.txt:x=200: y=h-80*t: fontsize=36:fontcolor=yellow@0.9: box=1:boxcolor=black@0.6"</span> -c:a copy outputCredits.mp4
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">specify the speed of scrolling using the y text position. Here, you</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">can provide an equation instead of a constant number. You start off</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">by telling by FFmpeg that the y-position is h - 80*t so that</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">everytime the value of time increases, the value of h - 80*t*</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">decreases, and the text is displayed higher. Tip:</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">change 80 to 100 or 120 and see the effect on the scrolling</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">speed.</span>

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shyam</p>
<p class="date">Created: 2021-03-13 Sat 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
